# all data about arithmetic in Python

print ( 2+ 3) # 5
print (10 - 3) # 7
print (10 * 3) # 30 
print (10 / 2) # 5.0
print (3 % 2) # 1 - залишок
print (3//2) # 1

print (7 % 2) # 1
print(7 // 2) # 3

print (-5 - 3) # 8

print ( 5 ** 2) # 25 - возводження до степені 5 в другій степені 
print (5** 3) # 125
print (25**0.5) # так можна знайти квадратний корінь з 25

# усі пріорітети в числах як і в математиці - але можна позначити пріорітет дужками

print ((2+5)* 3 / 25) # 0.84 - з пріорітетом

print (2+5* 3 / 25) # 2.6 - без пріорітету
